헤드 퍼스트 디자인패턴/1장.전략패턴/README.md
```mermaid
classDiagram

    Duck <|.. MallardDuck
    Duck --> FlyBehavior
    Duck --> QuackBehavior

    FlyBehavior <|.. FlyWithWings
    FlyBehavior <|.. FlyNoWay

    QuackBehavior <|.. Quack
    QuackBehavior <|.. Squack
    QuackBehavior <|.. MuteQuack

    namespace Client {
        class Duck {
            <<abstract>>
            Fly fly
            Quack quack

            performFly()
            performQuack()
            setFly()
            setQuack()
            display()
        }
        class MallardDuck {
            display()
        }
    }
    
    namespace FlyBehavior 캡슐화 {
        class FlyBehavior {
            <<interface>>
            fly()
        }
        class FlyWithWings {
            fly() 
        }
        class FlyNoWay {
            fly()
        }
    }
    
    namespace QuackBehavior 캡슐화 {
        class QuackBehavior {
            <<interface>>
            quack()
        }
        class Quack {
            quack()
        }
        class Squack {
            quack()
        }
        class MuteQuack {
            quack()
        }
    }
```
